Improve dashboard UI
